```

```
```
Terraform used the selected providers to generate the following execution
```
```
plan. Resource actions are indicated with the following symbols:
```
```
  ~ update in-place
```
```
-/+ destroy and then create replacement
```
```
 <= read (data resources)
```
```

```
```
Terraform will perform the following actions:
```
```

```
```
  # module.provision_k3s.data.local_sensitive_file.kubeconfig will be read during apply
```
```
  # (depends on a resource or a module with changes pending)
```
```
 <= data "local_sensitive_file" "kubeconfig" {
```
```
      + content              = (sensitive value)
```
```
      + content_base64       = (sensitive value)
```
```
      + content_base64sha256 = (known after apply)
```
```
      + content_base64sha512 = (known after apply)
```
```
      + content_md5          = (known after apply)
```
```
      + content_sha1         = (known after apply)
```
```
      + content_sha256       = (known after apply)
```
```
      + content_sha512       = (known after apply)
```
```
      + filename             = "/root/.kube/config-files/kub1k.yaml"
```
```
      + id                   = (known after apply)
```
```
    }
```
```

```
```
  # module.provision_k3s.null_resource.k3s_kubeconfig must be replaced
```
```
-/+ resource "null_resource" "k3s_kubeconfig" {
```
```
      ~ id       = "5822092583874720334" -> (known after apply)
```
```
      ~ triggers = { # forces replacement
```
```
          ~ "timestamp" = "2024-12-30T12:13:39Z" -> (known after apply)
```
```
        }
```
```
    }
```
```

```
```
  # module.provision_k3s.vault_kv_secret_v2.k3s will be updated in-place
```
```
  ~ resource "vault_kv_secret_v2" "k3s" {
```
```
      ~ data_json           = (sensitive value)
```
```
        id                  = "kv/data/kub1k/k3s"
```
```
        name                = "kub1k/k3s"
```
```
        # (6 unchanged attributes hidden)
```
```

```
```
        # (1 unchanged block hidden)
```
```
    }
```
```

```
```
Plan: 1 to add, 1 to change, 1 to destroy.
```